import { defineStore }  from 'pinia'
import { ref,computed,reactive } from 'vue'
export const useStore=defineStore('store',function(){

   //1.定义状态数据
   const count=ref(0);
  let getFirstList=reactive([
    {id:1, title: '海绵宝宝系列手办', 
     subItems: ' 海绵宝宝，派大星，谢老板' , hovered: false
    
     , course:[
      {id:1, title:'海宝1办',price: 20, count: 23, img: '/img/玩具/海1.jpg',buyToNum:0,sn0:11,introduce:'探索海底世界的小伙伴，海绵宝宝的挚友——派大星手办！这款精致手办完美再现了派大星的经典形象，粉红色的圆润身体，搭配他标志性的大眼睛和微笑表情，萌趣十足。手办细节精致，从小小的眼睛光芒到每一根触须的柔软质感，都经过精心雕琢。无论是摆放在办公桌还是家中收藏，都能为你的每一天带来无限的欢乐和温馨回忆。快来带回家，与派大星一起分享友谊的乐趣吧！'},
      {id:2, title:'海宝星星',price: 20, count: 45, img: '/img/玩具/海2.jpg',buyToNum:0,sn0:12,introduce:'探索海底世界的小伙伴，海绵宝宝的挚友——派大星手办！这款精致手办完美再现了派大星的经典形象，粉红色的圆润身体，搭配他标志性的大眼睛和微笑表情，萌趣十足。手办细节精致，从小小的眼睛光芒到每一根触须的柔软质感，都经过精心雕琢。无论是摆放在办公桌还是家中收藏，都能为你的每一天带来无限的欢乐和温馨回忆。快来带回家，与派大星一起分享友谊的乐趣吧'},
      {id:3, title:'海宝全家桶',price: 20, count: 2, img: '/img/玩具/海3.jpg',buyToNum:0,sn0:13,introduce:'海绵宝宝手办，以经典卡通形象打造，这款充满活力的手办展现了海绵宝宝乐观的笑容和他标志性的方形裤衩。鲜艳的黄色调与他的住家——菠萝屋相呼应，细节处理精细，从他那两颗大眼睛到脚下的沙滩小颗粒都栩栩如生。适合作为礼物或收藏品，为你的展示架增添一抹海洋风情，同时唤起你对这部经典动画的美好回忆'},
      {id:4, title:'疯狂海绵',price: 20, count: 1, img: '/img/玩具/海4.jpg',buyToNum:0,sn0:14,introduce:'疯狂抽象化--探索海底世界的小伙伴，海绵宝宝的挚友——派大星手办！这款精致手办完美再现了派大星的经典形象，粉红色的圆润身体，搭配他标志性的大眼睛和微笑表情，萌趣十足。手办细节精致，从小小的眼睛光芒到每一根触须的柔软质感，都经过精心雕琢。无论是摆放在办公桌还是家中收藏，都能为你的每一天带来无限的欢乐和温馨回忆。快来带回家，与派大星一起分享友谊的乐趣吧！'},

      ], },
    { id:2,title: '皮克斯系列周边', img: '/img/2.png', hovered: false,
    subItems: ' 毛怪鲍勃，神厨小米，巴斯光年，道格' ,
    course:[
          
      {id:1, title:'兔兔兄弟',price: 20, count: 100, img: '/img/玩具/21.jpg',buyToNum:0,sn0:21,introduce:'欢迎来到充满欢乐的兔兔兄弟手办世界！这对调皮又可爱的兄弟档以他们标志性的造型登场，一个带着调皮的微笑，一个露出淘气的眼神。手办细节丰富，从毛茸茸的耳朵到脚下的草地小配件，每一个角落都充满了惊喜。摆放在任何角落，都能为空间增添一份活泼与温馨。收藏家们，这是你们展示对兔兔兄弟无限喜爱的绝佳选择，快来让它们跳进你的生活中吧！' },
      {id:2, title:'苞米通通',price: 20, count: 50, img: '/img/玩具/22.jpg',buyToNum:0,sn0:22,introduce:'苞米卡通——这个虚拟的动画角色是一颗活泼可爱的玉米粒，身穿缤纷的衣服，带着灿烂的微笑。它不仅是农田里的明星，还是孩子们心中的朋友。在阳光照耀下，它总是充满活力，用它的甜美和乐趣给每个人带去正能量。无论是在动画片中还是作为手办、周边产品的形象，苞米卡通都准备随时把温暖和快乐传递给每一个遇见它的人。'},
      {id:3, title:'吉吉玩偶',price: 20, count: 2, img: '/img/玩具/23.jpg',buyToNum:0,sn0:23,introduce:'探索吉吉的微缩世界，一款充满魔法与梦想的玩偶手办系列。每款吉吉手办都精心雕刻，细节丰富，色彩鲜艳，带来视觉盛宴。它们不仅是收藏家的心头好，也是孩子们的忠实伙伴。让吉吉带领你进入一个充满欢笑与想象的虚拟乐园！'},
      {id:4, title:'木偶娃娃',price: 20, count: 5, img: '/img/玩具/24.jpg',buyToNum:0,sn0:24,introduce:'踏入奇幻的木偶世界，遇见栩栩如生的木偶娃娃。它们以精细的木雕工艺和温馨的色彩搭配著称，每个细节都充满匠心。不仅是孩童的玩伴，更是传递古老艺术与手工情感的使者。收藏一款，让童话般的温暖陪伴你的每一个日夜。'},
     
              
        ] },
    { id:3,title: '迪士尼系列周边', img: '/img/3.png' , hovered: false,
    subItems: ' 无敌破坏王，迪士尼公主，米琪，妙妙'  
    ,course:[
          
      {id:1, title:'米琪夫妻',price: 20, count: 1, img: '/img/玩具/31.png',buyToNum:0,sn0:31,introduce:'欢迎来到米奇和米妮的甜蜜世界！这对迪士尼的经典情侣形象，以他们浪漫而温馨的姿态出现。手办细节精致，从米奇的红色短裤到米妮的蝴蝶结，每一个角落都充满了爱意。摆放在任何角落，都能为空间增添一份浪漫与甜蜜。收藏家们，这是你们展示对米奇米妮无限喜爱的绝佳选择，快来让它们加入你的生活中吧！' },
      {id:2, title:'公主全家桶',price: 20, count: 0, img: '/img/玩具/32.jpeg',buyToNum:0,sn0:32,introduce:'欢迎来到迪士尼公主的梦幻世界！这个全家桶包含了多位你熟悉的公主形象，每一位都以她们独特的魅力和风格出现。手办细节丰富，从长发到裙摆，每一个角落都充满了童话般的梦幻。摆放在任何角落，都能为空间增添一份梦幻与浪漫。收藏家们，这是你们展示对迪士尼公主无限喜爱的绝佳选择，快来让她们走进你的生活中吧！'},
      {id:3, title:'金发娃娃',price: 20, count: 0, img: '/img/玩具/33.jpg',buyToNum:0,sn0:33,introduce:'欢迎来到金发娃娃的闪亮世界！这位金发娃娃以她的闪亮金色长发和甜美笑容出现。手办细节精致，从金色的长发到闪亮的裙子，每一个角落都充满了光芒。摆放在任何角落，都能为空间增添一份闪亮与活力。收藏家们，这是你们展示对金发娃娃无限喜爱的绝佳选择，快来让她跳进你的生活中吧！'},
      {id:4, title:'黑魔手膀',price: 20, count: 10, img: '/img/玩具/34.jpg',buyToNum:0,sn0:34,introduce:'欢迎来到黑魔手膀的神秘世界！这位神秘的黑魔手膀以他的酷炫造型和神秘气质出现。手办细节丰富，从黑色的披风到手中的魔法杖，每一个角落都充满了神秘。摆放在任何角落，都能为空间增添一份神秘与酷炫。收藏家们，这是你们展示对黑魔手膀无限喜爱的绝佳选择，快来让他走进你的生活中吧！'}

              
        ] },
    { id:4,title: '其他周边', img: '/img/3.png', hovered: false,
    subItems: ' 葫芦娃，羊羊系列，熊出没'    ,
    course:[
          
      {id:1, title:'熊熊',price: 20, count: 0, img: '/img/玩具/41.jpg',buyToNum:0,sn0:41,introduce:'欢迎来到熊熊的温暖世界！这只可爱的熊熊以它柔软的毛发和温馨的笑容出现。手办细节精致，从熊熊的大眼睛到它的小爪子，每一个角落都充满了温暖。摆放在任何角落，都能为空间增添一份温馨与舒适。收藏家们，这是你们展示对熊熊无限喜爱的绝佳选择，快来让它进入你的生活吧！'},
      {id:2, title:'喜羊羊',price: 20, count: 100, img: '/img/玩具/42.png',buyToNum:0,sn0:42,introduce:'欢迎来到喜羊羊的欢乐世界！这只活泼的喜羊羊以它的快乐笑容和灵动的眼神出现。手办细节丰富，从喜羊羊的卷毛到它的衣服，每一个角落都充满了欢乐。摆放在任何角落，都能为空间增添一份快乐与活力。收藏家们，这是你们展示对喜羊羊无限喜爱的绝佳选择，快来让它加入你的生活吧！'},
      {id:3, title:'懒美',price: 20, count: 11, img: '/img/玩具/43.jpg',buyToNum:0,sn0:43,introduce:'欢迎来到懒美的悠闲世界！这只憨态可掬的懒美以它的慵懒姿态和甜美笑容出现。手办细节精致，从懒美的柔软毛发到它的眼睛，每一个角落都充满了舒适。摆放在任何角落，都能为空间增添一份悠闲与惬意。收藏家们，这是你们展示对懒美无限喜爱的绝佳选择，快来让它进入你的生活吧！'},
      {id:4, title:'布偶羊',price: 20, count: 9, img: '/img/玩具/44.jpg',buyToNum:0,sn0:44,introduce:'欢迎来到布偶羊的温馨世界！这只可爱的布偶羊以它的柔软毛发和甜美笑容出现。手办细节丰富，从布偶羊的眼睛到它的小蹄子，每一个角落都充满了温馨。摆放在任何角落，都能为空间增添一份温馨与舒适。收藏家们，这是你们展示对布偶羊无限喜爱的绝佳选择，快来让它进入你的生活吧！'}
              
        ]},
   
  ]);
  let CartList=ref([
    
      {id:1, title:'海宝1办',price: 20, count: 23, img: '/img/玩具/海1.jpg',buyToNum:0,sn0:11,introduce:'探索海底世界的小伙伴，海绵宝宝的挚友——派大星手办！这款精致手办完美再现了派大星的经典形象，粉红色的圆润身体，搭配他标志性的大眼睛和微笑表情，萌趣十足。手办细节精致，从小小的眼睛光芒到每一根触须的柔软质感，都经过精心雕琢。无论是摆放在办公桌还是家中收藏，都能为你的每一天带来无限的欢乐和温馨回忆。快来带回家，与派大星一起分享友谊的乐趣吧！'},
      {id:2, title:'海宝星星',price: 20, count: 45, img: '/img/玩具/海2.jpg',buyToNum:0,sn0:12,introduce:'探索海底世界的小伙伴，海绵宝宝的挚友——派大星手办！这款精致手办完美再现了派大星的经典形象，粉红色的圆润身体，搭配他标志性的大眼睛和微笑表情，萌趣十足。手办细节精致，从小小的眼睛光芒到每一根触须的柔软质感，都经过精心雕琢。无论是摆放在办公桌还是家中收藏，都能为你的每一天带来无限的欢乐和温馨回忆。快来带回家，与派大星一起分享友谊的乐趣吧'},
      {id:3, title:'海宝全家桶',price: 20, count: 2, img: '/img/玩具/海3.jpg',buyToNum:0,sn0:13,introduce:'海绵宝宝手办，以经典卡通形象打造，这款充满活力的手办展现了海绵宝宝乐观的笑容和他标志性的方形裤衩。鲜艳的黄色调与他的住家——菠萝屋相呼应，细节处理精细，从他那两颗大眼睛到脚下的沙滩小颗粒都栩栩如生。适合作为礼物或收藏品，为你的展示架增添一抹海洋风情，同时唤起你对这部经典动画的美好回忆'},
      {id:4, title:'疯狂海绵',price: 20, count: 1, img: '/img/玩具/海4.jpg',buyToNum:0,sn0:14,introduce:'疯狂抽象化--探索海底世界的小伙伴，海绵宝宝的挚友——派大星手办！这款精致手办完美再现了派大星的经典形象，粉红色的圆润身体，搭配他标志性的大眼睛和微笑表情，萌趣十足。手办细节精致，从小小的眼睛光芒到每一根触须的柔软质感，都经过精心雕琢。无论是摆放在办公桌还是家中收藏，都能为你的每一天带来无限的欢乐和温馨回忆。快来带回家，与派大星一起分享友谊的乐趣吧！'},

      ,
   
          
      {id:5, title:'兔兔兄弟',price: 20, count: 100, img: '/img/玩具/21.jpg',buyToNum:0,sn0:21,introduce:'欢迎来到充满欢乐的兔兔兄弟手办世界！这对调皮又可爱的兄弟档以他们标志性的造型登场，一个带着调皮的微笑，一个露出淘气的眼神。手办细节丰富，从毛茸茸的耳朵到脚下的草地小配件，每一个角落都充满了惊喜。摆放在任何角落，都能为空间增添一份活泼与温馨。收藏家们，这是你们展示对兔兔兄弟无限喜爱的绝佳选择，快来让它们跳进你的生活中吧！' },
      {id:6, title:'苞米通通',price: 20, count: 50, img: '/img/玩具/22.jpg',buyToNum:0,sn0:22,introduce:'苞米卡通——这个虚拟的动画角色是一颗活泼可爱的玉米粒，身穿缤纷的衣服，带着灿烂的微笑。它不仅是农田里的明星，还是孩子们心中的朋友。在阳光照耀下，它总是充满活力，用它的甜美和乐趣给每个人带去正能量。无论是在动画片中还是作为手办、周边产品的形象，苞米卡通都准备随时把温暖和快乐传递给每一个遇见它的人。'},
      {id:7, title:'吉吉玩偶',price: 20, count: 2, img: '/img/玩具/23.jpg',buyToNum:0,sn0:23,introduce:'探索吉吉的微缩世界，一款充满魔法与梦想的玩偶手办系列。每款吉吉手办都精心雕刻，细节丰富，色彩鲜艳，带来视觉盛宴。它们不仅是收藏家的心头好，也是孩子们的忠实伙伴。让吉吉带领你进入一个充满欢笑与想象的虚拟乐园！'},
      {id:8, title:'木偶娃娃',price: 20, count: 5, img: '/img/玩具/24.jpg',buyToNum:0,sn0:24,introduce:'踏入奇幻的木偶世界，遇见栩栩如生的木偶娃娃。它们以精细的木雕工艺和温馨的色彩搭配著称，每个细节都充满匠心。不仅是孩童的玩伴，更是传递古老艺术与手工情感的使者。收藏一款，让童话般的温暖陪伴你的每一个日夜。'},
     
              
      ,
    
          
      {id:9, title:'米琪夫妻',price: 20, count: 1, img: '/img/玩具/31.png',buyToNum:0,sn0:31,introduce:'欢迎来到米奇和米妮的甜蜜世界！这对迪士尼的经典情侣形象，以他们浪漫而温馨的姿态出现。手办细节精致，从米奇的红色短裤到米妮的蝴蝶结，每一个角落都充满了爱意。摆放在任何角落，都能为空间增添一份浪漫与甜蜜。收藏家们，这是你们展示对米奇米妮无限喜爱的绝佳选择，快来让它们加入你的生活中吧！' },
      {id:10, title:'公主全家桶',price: 20, count: 0, img: '/img/玩具/32.jpeg',buyToNum:0,sn0:32,introduce:'欢迎来到迪士尼公主的梦幻世界！这个全家桶包含了多位你熟悉的公主形象，每一位都以她们独特的魅力和风格出现。手办细节丰富，从长发到裙摆，每一个角落都充满了童话般的梦幻。摆放在任何角落，都能为空间增添一份梦幻与浪漫。收藏家们，这是你们展示对迪士尼公主无限喜爱的绝佳选择，快来让她们走进你的生活中吧！'},
      {id:11, title:'金发娃娃',price: 20, count: 0, img: '/img/玩具/33.jpg',buyToNum:0,sn0:33,introduce:'欢迎来到金发娃娃的闪亮世界！这位金发娃娃以她的闪亮金色长发和甜美笑容出现。手办细节精致，从金色的长发到闪亮的裙子，每一个角落都充满了光芒。摆放在任何角落，都能为空间增添一份闪亮与活力。收藏家们，这是你们展示对金发娃娃无限喜爱的绝佳选择，快来让她跳进你的生活中吧！'},
      {id:12, title:'黑魔手膀',price: 20, count: 10, img: '/img/玩具/34.jpg',buyToNum:0,sn0:34,introduce:'欢迎来到黑魔手膀的神秘世界！这位神秘的黑魔手膀以他的酷炫造型和神秘气质出现。手办细节丰富，从黑色的披风到手中的魔法杖，每一个角落都充满了神秘。摆放在任何角落，都能为空间增添一份神秘与酷炫。收藏家们，这是你们展示对黑魔手膀无限喜爱的绝佳选择，快来让他走进你的生活中吧！'}
      ,
   
          
      {id:13, title:'熊熊',price: 20, count: 0, img: '/img/玩具/41.jpg',buyToNum:0,sn0:41,introduce:'欢迎来到熊熊的温暖世界！这只可爱的熊熊以它柔软的毛发和温馨的笑容出现。手办细节精致，从熊熊的大眼睛到它的小爪子，每一个角落都充满了温暖。摆放在任何角落，都能为空间增添一份温馨与舒适。收藏家们，这是你们展示对熊熊无限喜爱的绝佳选择，快来让它进入你的生活吧！'},
      {id:14, title:'喜羊羊',price: 20, count: 100, img: '/img/玩具/42.png',buyToNum:0,sn0:42,introduce:'欢迎来到喜羊羊的欢乐世界！这只活泼的喜羊羊以它的快乐笑容和灵动的眼神出现。手办细节丰富，从喜羊羊的卷毛到它的衣服，每一个角落都充满了欢乐。摆放在任何角落，都能为空间增添一份快乐与活力。收藏家们，这是你们展示对喜羊羊无限喜爱的绝佳选择，快来让它加入你的生活吧！'},
      {id:15, title:'懒美',price: 20, count: 11, img: '/img/玩具/43.jpg',buyToNum:0,sn0:43,introduce:'欢迎来到懒美的悠闲世界！这只憨态可掬的懒美以它的慵懒姿态和甜美笑容出现。手办细节精致，从懒美的柔软毛发到它的眼睛，每一个角落都充满了舒适。摆放在任何角落，都能为空间增添一份悠闲与惬意。收藏家们，这是你们展示对懒美无限喜爱的绝佳选择，快来让它进入你的生活吧！'},
      {id:16, title:'布偶羊',price: 20, count: 9, img: '/img/玩具/44.jpg',buyToNum:0,sn0:44,introduce:'欢迎来到布偶羊的温馨世界！这只可爱的布偶羊以它的柔软毛发和甜美笑容出现。手办细节丰富，从布偶羊的眼睛到它的小蹄子，每一个角落都充满了温馨。摆放在任何角落，都能为空间增添一份温馨与舒适。收藏家们，这是你们展示对布偶羊无限喜爱的绝佳选择，快来让它进入你的生活吧！'}
              
      
              
       
   
  ]);


 
 
//   subItems: [  
//     { id:1,name: '子项A1', value: '初始值A' },  
//     { id:2, name: '子项B', value: '初始值B' }  
// ]
   //2.定义计算属性：根据状态数据的变化进行计算
   const doubleCount=computed( ()=>count.value*2 )

   const buyCarts=reactive([])

  // // 从本地存储中读取购物车列表，并将其提交到状态存储中
  // const initFromLocalStorage = () => {
  //   console.log('hijao')
  //   const items = JSON.parse(localStorage.getItem('buyCarts_list')) || []
  //   buyCarts.push = items
  // }

  return  { getFirstList,CartList } //返回对象值（所有定义的成员）
})
